ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5e0d9dd9-464c-4fa3-984a-2a2da8517f38">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7af43f23-66b5-4041-bd23-3216b1d23915">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="49c74d36-ce0a-47f3-b6eb-899238c5cc0f">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c3c6b97e-7d9a-4a6b-8cfd-5a1d2a1e2450">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb8b5ad-0eec-40f5-88b2-f1412f212359">
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a595dc27-9b9c-47fc-a70f-c6763ab3d7a2">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd906d50-e8be-4b18-b32c-c20813240936">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c545b75d-dd2d-4844-903e-a04b725622b7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="87bdbf54-2a81-44f1-b7b9-18f0ca2a2511">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3c31986-dede-48b5-9cc7-1c35e4fb81f6">
    <name>ПродажаПоПатенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="015a5e71-6dc7-4bc2-a50c-fa1ea71ab233">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888045d6-ba8c-43b1-b536-7c557764fc60">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b94b39c7-d1eb-4128-89ea-6fe5410160da">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50c9ead0-2833-4f57-86bb-47fa6ffdc8aa">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73c9f7da-a335-4b2e-976f-57e95ab06e13">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5b27a28-42e1-42b3-806c-83e1fbeb7907">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a37e84ac-bf38-4699-99ca-e57572841cfc">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e4986aa8-bcf8-443e-9b49-4140b2505fa4">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/ПриобретениеТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура рвк_СформироватьПоРеализации(ДанныеЗаполнения) Экспорт

	ОбменДаннымиСервер.Пауза(3);

	Отказ =  Ложь;

	Реализация = ДанныеЗаполнения.Ссылка;

	РежимЗаписи = ДанныеЗаполнения.РежимЗаписи;

	ПриобретениеGUID = Документы.РеализацияТоваровУслуг.рвк_ПриобретениеИнтеркампани(ДанныеЗаполнения.Ссылка);
	Если ЗначениеЗаполнено(ПриобретениеGUID) Тогда
		Приобретение = ПолучитьСсылку(Новый УникальныйИдентификатор(ПриобретениеGUID));
		ПриобретениеОбъект = Неопределено;
		Если ЗначениеЗаполнено(Приобретение) Тогда
			ПриобретениеОбъект = Приобретение.ПолучитьОбъект();
		КонецЕсли;
		СсылкаЛиквидна = ПриобретениеОбъект <> Неопределено;
		Если СсылкаЛиквидна Тогда
			Если ДанныеЗаполнения.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Если Не ПриобретениеОбъект.Проведен И ПриобретениеОбъект.ПометкаУдаления Тогда
					ПриобретениеОбъект.ПометкаУдаления = Ложь;
				КонецЕсли;
			ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись И ПриобретениеОбъект.Проведен Тогда
				Попытка
					ПриобретениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ТекстСообщения = СтрШаблон("Не удалось отменить проведение для Приобретения: %1 по причине: %2",
						Приобретение,
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					рвк_ЖурналРегистрацииВызовСервера.ЗаписатьОшибку("Интеркампани", ТекстСообщения, Реализация, Отказ);
					Возврат;
				КонецПопытки;
			КонецЕсли;
			Если ДанныеЗаполнения.ПометкаУдаления И Не ПриобретениеОбъект.ПометкаУдаления Тогда
				ПриобретениеОбъект.ПометкаУдаления = Истина;
			КонецЕсли;
		Иначе
			ПриобретениеОбъект = СоздатьДокумент();
		КонецЕсли;
	Иначе // Нет приобретения
		Если ДанныеЗаполнения.ПометкаУдаления Тогда
			Возврат;
		Иначе
			ПриобретениеОбъект = СоздатьДокумент();
		КонецЕсли;
	КонецЕсли;

	ПриобретениеОбъект.Заполнить(ДанныеЗаполнения.СоглашениеСПоставщиком);
	ПриобретениеОбъект.Дата = НачалоДня(ДанныеЗаполнения.Дата);
	ПриобретениеОбъект.ДатаВходящегоДокумента = ДанныеЗаполнения.Дата;
	ПриобретениеОбъект.НомерВходящегоДокумента = ДанныеЗаполнения.Номер;
	ПриобретениеОбъект.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту;

	Склад = ПриобретениеОбъект.Склад;
	ТаблицаТоваров = ДанныеЗаполнения.ТаблицаТоваров;
	ТаблицаТоваров.ЗаполнитьЗначения(Склад, "Склад");

	ПриобретениеОбъект.Товары.Загрузить(ТаблицаТоваров);
	ПриобретениеОбъект.ЗаполнитьУсловияЗакупокПоСоглашению(Ложь);
	ПриобретениеОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ПриобретениеОбъект.Согласован = Истина;

//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		ПриобретениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
//		ПриобретениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
//	КонецЕсли;

	//ПриобретениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольОстатковПоОрганизации", Истина);

	Попытка
		ПриобретениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
		ПриобретениеОбъект.Записать(РежимЗаписи);
		Приобретение = ПриобретениеОбъект.Ссылка;
		Документы.РеализацияТоваровУслуг.рвк_ОбновитьСсылкуНаПриобретение(Реализация, Приобретение);
		ТекстСообщения = СтрШаблон("Обновлено: %1 с режимом записи: %2",
			Приобретение,
			РежимЗаписи);
		рвк_ЖурналРегистрацииВызовСервера.ЗаписатьИнформацию("Интеркампани", ТекстСообщения, Реализация);

	Исключение
		ТекстСообщения = СтрШаблон("Не удалось записать: %1 с режимом записи: %2 по причине: %3",
			"" + Приобретение + Символы.ПС,
			"" + РежимЗаписи + Символы.ПС,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		рвк_ЖурналРегистрацииВызовСервера.ЗаписатьОшибку("Интеркампани", ТекстСообщения, Реализация, Отказ);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

КонецПроцедуры

//Процедура рвк_ПровестиДокумент(Реализация) Экспорт
//
//	ПриобретениеGUID = Документы.РеализацияТоваровУслуг.рвк_ПриобретениеИнтеркампани(Реализация);
//	Если Не ЗначениеЗаполнено(ПриобретениеGUID) Тогда
//		Возврат;
//	КонецЕсли;
//
//	Приобретение = ПолучитьСсылку(Новый УникальныйИдентификатор(ПриобретениеGUID));
//	Если Не ЗначениеЗаполнено(Приобретение) Тогда
//		Возврат;
//	КонецЕсли;
//
//	ПриобретениеОбъект = Приобретение.ПолучитьОбъект();
//	ПриобретениеОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
//	ПриобретениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
//
//КонецПроцедуры

Функция рвк_НовыеДанныеЗаполнения() Экспорт

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Ссылка");
	ДанныеЗаполнения.Вставить("ПометкаУдаления", Ложь);
	ДанныеЗаполнения.Вставить("Проведен", Истина);
	ДанныеЗаполнения.Вставить("ТаблицаТоваров");
	ДанныеЗаполнения.Вставить("Дата");
	ДанныеЗаполнения.Вставить("Номер");
	ДанныеЗаполнения.Вставить("СоглашениеСПоставщиком");
	ДанныеЗаполнения.Вставить("РежимЗаписи");

	Возврат ДанныеЗаполнения;

КонецФункции

#КонецОбласти

#КонецЕсли
